In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load in 

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

# Any results you write to the current directory are saved as output.

/kaggle/input/titanic/gender_submission.csv
/kaggle/input/titanic/test.csv
/kaggle/input/titanic/train.csv

In [2]:
train= pd.read_csv('/kaggle/input/titanic/train.csv')
train.shape

(891, 12)

In [3]:
test=pd.read_csv('/kaggle/input/titanic/test.csv')
test.shape

(418, 11)

In [4]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [6]:
for i in train.columns[train.dtypes==object]:
    le.fit(list(train[i])+list(test[i]))
    train[i]=le.transform(list(train[i]))
    test[i]=le.transform (list(test[i]))

In [7]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,155,1,22.0,1,0,720,7.2500,186,2
1,2,1,1,286,0,38.0,1,0,816,71.2833,106,0
2,3,1,3,523,0,26.0,0,0,914,7.9250,186,2
3,4,1,1,422,0,35.0,1,0,65,53.1000,70,2
4,5,0,3,22,1,35.0,0,0,649,8.0500,186,2

In [8]:
train.shape

(891, 12)

In [9]:
test.shape ## 살았는지 죽엇는지

(418, 11)

In [10]:
train2= train.drop(['PassengerId','Survived','Name'],axis=1)
train2.head()

   Pclass  Sex   Age  SibSp  Parch  Ticket     Fare  Cabin  Embarked
0       3    1  22.0      1      0     720   7.2500    186         2
1       1    0  38.0      1      0     816  71.2833    106         0
2       3    0  26.0      0      0     914   7.9250    186         2
3       1    0  35.0      1      0      65  53.1000     70         2
4       3    1  35.0      0      0     649   8.0500    186         2

In [11]:
test2=test.drop(['PassengerId','Name'],axis=1)
test2.head()

   Pclass  Sex   Age  SibSp  Parch  Ticket     Fare  Cabin  Embarked
0       3    1  34.5      0      0     376   7.8292    186         1
1       3    0  47.0      1      0     582   7.0000    186         2
2       2    1  62.0      0      0     184   9.6875    186         1
3       3    1  27.0      0      0     366   8.6625    186         2
4       3    0  22.0      1      1     338  12.2875    186         2

In [12]:
# train3= train2.fillna(-1)
# test3=test2.fillna(-1)

In [13]:
# from sklearn.ensemble import RandomForestClassifier
# rf= RandomForestClassifier(n_estimators=200,n_jobs=4,random_state=2016)
# rf.fit(train3,train['Survived'])
# result=rf.predict(test3)

In [14]:
# from lightgbm import LGBMClassifier
# lgb=LGBMClassifier()
# lgb.fit(train3,train['Survived'])
# result = lgb.predict(test3)

In [15]:
from xgboost import XGBClassifier
xgb=XGBClassifier(max_depth=8)
xgb.fit(train3,train['Survived'])
result= xgb.predict(test3)

NameError: name 'train3' is not defined

In [16]:
result.shape

NameError: name 'result' is not defined

In [17]:
sub=pd.read_csv('/kaggle/input/titanic/gender_submission.csv')
sub.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [18]:
sub['Survived']=result
sub.head()

NameError: name 'result' is not defined

In [19]:
sub.to_csv('sample.csv',index=False)